Config/Catalogs/БСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БСО</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/AccumulationRegisters/ДвиженияБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияБСО</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерНачальный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКонечный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Catalogs/БСО/Forms/ФормаПодбора/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем ФормаВводаКоличества Экспорт; // Для кэширования формы ввода количества. Может обнуляться из формы настройки подбора.
&НаКлиенте
Перем КонтекстФормы; // Запоминается контекст для асинхронного запроса количества при выборе БСО

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Организация,ЦМО,ИФО,КФО,Подразделение,СчетУчета");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "СчетУчета", СчетУчета,,, Истина);
	
	Если БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетУчета).УчетПоПодразделениям Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Подразделение", Подразделение,,, Истина);
	КонецЕсли;
	
	ДатаОстатков = Параметры.ДатаОстатков;
	Если ЗначениеЗаполнено(ДатаОстатков) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Период", ДатаОстатков);
	Иначе
		Элементы.ДатаОстатков.Видимость = Ложь;
	КонецЕсли;
	Элементы.СписокОтбор.Видимость = Параметры.Отбор.Количество()<>0;
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресВХранилище) Тогда
		ТаблицаПодобранных.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище));
		АдресВХранилище = Параметры.АдресВХранилище;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Отказ = Истина;

		ТекстВопроса = НСтр("ru='Таблица БСО для переноса в документ изменена.
							|Обновить табличную часть БСО в документе?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Обновить БСО в документе'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Не изменять документ'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗапроситьПереносДанныхВДокументЗавершение", ЭтотОбъект),
			ТекстВопроса, Кнопки, 60, КодВозвратаДиалога.Отмена);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПредставлениеНастроекОтбора();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения")
		И ИсточникВыбора.ИмяФормы = "Справочник.БСО.Форма.ФормаВводаКоличества" Тогда
		
		ОбработатьВыборКоличества(ВыбранноеЗначение);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстНастройкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.БСО.Форма.НастройкаПодбора", , ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДобавитьВОтобранные();
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДобавитьВОтобранные();
	Модифицированность=Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПодобранных

&НаКлиенте
Процедура ТаблицаПодобранныхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	#Если НЕ ВебКлиент Тогда
	УправлениеМатериальнымиЗапасамиКлиент.УстановитьМаскуПолейПорядковогоНомера(
		Элементы.ТаблицаПодобранных.ТекущиеДанные.ДлинаНомера,
		Элементы.ТаблицаПодобранныхНомерНачальный,
		Элементы.ТаблицаПодобранныхНомерКонечный);
	#КонецЕсли
	Если НоваяСтрока Тогда
		Элементы.ТаблицаПодобранных.ТекущиеДанные.ИдентификаторСтроки = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодобранныхПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	#Если ВебКлиент Тогда
	ТекущиеДанные = Элементы.ТаблицаПодобранных.ТекущиеДанные;		
	Если ТекущиеДанные.ДлинаНомера<>0 Тогда
		ТекстСообщения = НСтр("ru='Длина [Представление] номера ([ФактическаяДлина]) больше допустимой для данного БСО ([ДлинаНомера])'");
		Если СтрДлина(СокрЛП(ТекущиеДанные.НомерНачальный)) > ТекущиеДанные.ДлинаНомера Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщения,
					Новый Структура("Представление,ФактическаяДлина,ДлинаНомера",
									"начального", 
									СтрДлина(СокрЛП(ТекущиеДанные.НомерНачальный)),
									ТекущиеДанные.ДлинаНомера)),,,,Отказ);
		КонецЕсли;
		Если СтрДлина(СокрЛП(ТекущиеДанные.НомерКонечный)) > ТекущиеДанные.ДлинаНомера Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщения,
					Новый Структура("Представление,ФактическаяДлина,ДлинаНомера",
									"конечного", 
									СтрДлина(СокрЛП(ТекущиеДанные.НомерКонечный)),
									ТекущиеДанные.ДлинаНомера)),,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодобранныхНомерНачальныйПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаПодобранных.ТекущиеДанные;
	ОтформатироватьВведенныйНомерБСО(ТекущиеДанные, "НомерНачальный",, "ТаблицаПодобранных");
	УправлениеМатериальнымиЗапасамиКлиент.ЗаполнитьНомерКонечныйПоНомеруНачальномуИКоличеству(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодобранныхНомерКонечныйПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаПодобранных.ТекущиеДанные;
	ОтформатироватьВведенныйНомерБСО(ТекущиеДанные, "НомерКонечный", Истина, "ТаблицаПодобранных");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодобранныхКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаПодобранных.ТекущиеДанные;
	УправлениеМатериальнымиЗапасамиКлиент.ЗаполнитьНомерКонечныйПоНомеруНачальномуИКоличеству(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ЗакрытьСОбновлениемДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументВсе(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПеренестиВДокументВсеЗавершение", ЭтотОбъект),
		НСтр("ru = 'Все объекты, соответствующие отбору, будут перенесены в документ.
					|Продолжить?'"), РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПеренестиВДокументВсеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	АдресОСВХранилище = ПеренестиВДокументВсеНаСервере();
	
	Структура = Новый Структура("АдресОСВХранилище", АдресОСВХранилище);
	ПеренестиВДокумент = Ложь;
	ДобавленыНовыеОС = Ложь;
	ОповеститьОВыборе(АдресОСВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьПереносДанныхВДокументЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗакрытьСОбновлениемДокумента();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры // ЗапроситьПереносДанныхВДокумент()

&НаКлиенте
Процедура ЗакрытьСОбновлениемДокумента()

	ПоместитьСписокПодобранныхВХранилище();
	Модифицированность = Ложь;
	ОповеститьОВыборе(АдресВХранилище);

КонецПроцедуры // ЗакрытьСОбновлениемДокумента()

&НаКлиенте
Процедура ДобавитьВОтобранные()

	ЗаполнитьКонтекстФормы();
	
	ПродолжитьДобавлениеОтобранных()

КонецПроцедуры // ДобавитьВОтобранные()

&НаКлиенте
Процедура ПродолжитьДобавлениеОтобранных()

	Для ИндексСтроки = КонтекстФормы.ТекущийИндекс По КонтекстФормы.ВГраница Цикл
		
		КонтекстФормы.ТекущийИндекс = ИндексСтроки;
		
		ТекущиеДанные = Элементы.Список.ДанныеСтроки(КонтекстФормы.ВыделенныеСтроки[ИндексСтроки]);
		СтруктураКоличество = Новый Структура("Количество", 0);
		ЗаполнитьЗначенияСвойств(СтруктураКоличество, ТекущиеДанные);
		КоличествоДобавления = СтруктураКоличество.Количество;
		РезультатЗапроса = Неопределено;
		Если ПереноситьВсе Тогда
			
			ПараметрыОстатков = ПараметрыПолученияОстатковБСО(ЭтаФорма, ТекущиеДанные.БСО, ТекущиеДанные.СерияБСО);
			ДипазоныОстатков = ПолучитьДиапазоныОстатковБСО(ПараметрыОстатков);
			
			Для каждого ТекДиапазон Из ДипазоныОстатков Цикл
				
				ДобавитьПозициюВКорзину(ТекущиеДанные, ТекДиапазон.Количество, ТекДиапазон.НомерНачальный,
					ТекДиапазон.НомерКонечный, Истина);
				
			КонецЦикла;
			
		Иначе
			
			Если ЗапрашиватьКоличество Тогда
				
				
				ОткрытьФормуВводаКоличества(ТекущиеДанные.БСО, ТекущиеДанные.СерияБСО, КоличествоДобавления,
					ТекущиеДанные.ДлинаНомера);
				Возврат;
				
			КонецЕсли;
			
			ДобавитьПозициюВКорзину(ТекущиеДанные, КоличествоДобавления)
			
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры // ПродолжитьДобавлениеОтобранных()

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыПолученияОстатковБСО(Форма, БСО, СерияБСО)

	Параметры = Новый Структура;
	Параметры.Вставить("Период",		Форма.ДатаОстатков);
	Параметры.Вставить("Организация",	Форма.Организация);
	Параметры.Вставить("БСО",			БСО);
	Параметры.Вставить("СерияБСО",		СерияБСО);
	Параметры.Вставить("ЦМО",			Форма.ЦМО);
	Параметры.Вставить("КФО",			Форма.КФО);
	Параметры.Вставить("ИФО",			Форма.ИФО);
	Параметры.Вставить("Подразделение",	Форма.Подразделение);
	Параметры.Вставить("СчетУчета",		Форма.СчетУчета);
	Параметры.Вставить("ИспользоватьУчетПоИФО",
		ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО"));
	Параметры.Вставить("ИспользоватьУчетПоПодразделениям",
		ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоПодразделениям")
		И БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Форма.СчетУчета).УчетПоПодразделениям);
	Возврат Параметры;

КонецФункции // ПараметрыПолученияОстатковБСО()

&НаСервереБезКонтекста
Функция ПолучитьДиапазоныОстатковБСО(Знач Параметры)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияБСО.НомерНачальный КАК НомерНачальный,
	|	ДвиженияБСО.НомерКонечный,
	|	ВЫБОР
	|		КОГДА ДвиженияБСО.ВидДвижения = ЗНАЧЕНИЕ(ВидДВиженияНАкопления.Приход)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Расход,
	|	ДвиженияБСО.Количество,
	|	ДвиженияБСО.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ДвиженияБСО КАК ДвиженияБСО
	|ГДЕ
	|	ДвиженияБСО.Организация = &Организация
	|	И ДвиженияБСО.БСО = &БСО
	|	И ДвиженияБСО.СерияБСО = &СерияБСО
	|	И ДвиженияБСО.ЦМО = &ЦМО
	|	И ДвиженияБСО.КФО = &КФО
	|	И (ДвиженияБСО.ИФО = &ИФО
	|			ИЛИ НЕ &ИспользоватьУчетПоИФО)
	|	И (ДвиженияБСО.Подразделение = &Подразделение
	|			ИЛИ НЕ &ИспользоватьУчетПоПодразделениям)
	|	И ДвиженияБСО.Период <= &Период
	|	И ДвиженияБСО.СчетУчета = &СчетУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("Период",			Параметры.Период);
	Запрос.УстановитьПараметр("Организация",	Параметры.Организация);
	Запрос.УстановитьПараметр("БСО",			Параметры.БСО);
	Запрос.УстановитьПараметр("СерияБСО",		Параметры.СерияБСО);
	Запрос.УстановитьПараметр("ЦМО",			Параметры.ЦМО);
	Запрос.УстановитьПараметр("КФО",			Параметры.КФО);
	Запрос.УстановитьПараметр("ИФО",			Параметры.ИФО);
	Запрос.УстановитьПараметр("Подразделение",	Параметры.Подразделение);
	Запрос.УстановитьПараметр("СчетУчета",		Параметры.СчетУчета);
	
	Запрос.УстановитьПараметр("ИспользоватьУчетПоИФО",				Параметры.ИспользоватьУчетПоИФО);
	Запрос.УстановитьПараметр("ИспользоватьУчетПоПодразделениям",	Параметры.ИспользоватьУчетПоПодразделениям);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДвиженийПоНомерам = Новый ТаблицаЗначений;
	ТаблицаДвиженийПоНомерам.Колонки.Добавить("Номер", 		Новый ОписаниеТипов("Число"));
	ТаблицаДвиженийПоНомерам.Колонки.Добавить("Количество",	Новый ОписаниеТипов("Число"));

	Для каждого СтрокаДвижения Из ТаблицаДвижений Цикл
	
		Если ЗначениеЗаполнено(СтрокаДвижения.НомерНачальный) Тогда
			НачалоСчетчика = СтрокаДвижения.НомерНачальный;
		Иначе
			НачалоСчетчика = 0;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаДвижения.НомерКонечный) Тогда
			КонецСчетчика = СтрокаДвижения.НомерКонечный;
		Иначе
			КонецСчетчика = НачалоСчетчика;
		КонецЕсли;
		
		ДобавляемоеКоличество = ?(СтрокаДвижения.Расход = 0, 1, -1) * ?(СтрокаДвижения.Количество < 0, -1, 1);
		Для Счетчик=НачалоСчетчика По КонецСчетчика Цикл
			НовДвижение = ТаблицаДвиженийПоНомерам.Добавить();
			НовДвижение.Номер = Счетчик;
			НовДвижение.Количество = ДобавляемоеКоличество;
		КонецЦикла;
	
	КонецЦикла;
	
	ТаблицаОстатков = ТаблицаДвижений.СкопироватьКолонки();
	ТаблицаДвиженийПоНомерам.Свернуть("Номер", "Количество");
	ТаблицаДвиженийПоНомерам.Сортировать("Номер");
	СтрокаОстатков = Неопределено;
	Для каждого Движение Из ТаблицаДвиженийПоНомерам Цикл
				
		Если Движение.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
				
		Если СтрокаОстатков = Неопределено
			ИЛИ (СтрокаОстатков.НомерКонечный+1) <> Движение.Номер Тогда
			СтрокаОстатков = ТаблицаОстатков.Добавить();
			СтрокаОстатков.НомерНачальный = Движение.Номер;
			СтрокаОстатков.НомерКонечный = Движение.Номер;
			СтрокаОстатков.Количество = 1;
		Иначе
			СтрокаОстатков.НомерКонечный = Движение.Номер;
			СтрокаОстатков.Количество = СтрокаОстатков.Количество + 1;
		КонецЕсли;
	
	КонецЦикла;
	
	Результат = Новый Массив;
	Для каждого Остатки Из ТаблицаОстатков Цикл
	
		Результат.Добавить(Новый Структура("НомерНачальный, НомерКонечный, Количество", 
											Остатки.НомерНачальный,
											Остатки.НомерКонечный,
											Остатки.Количество));
	
	КонецЦикла; 
	
	Возврат Результат;

КонецФункции // ПолучитьДиапазоныОстатковБСО()

&НаКлиенте
Процедура ОткрытьФормуВводаКоличества(БСО, СерияБСО, КоличествоДобавления, ДлинаНомера)

	ФормаВводаКоличества.БСО				= БСО;
	ФормаВводаКоличества.СерияБСО 			= СерияБСО;
	ФормаВводаКоличества.КоличествоОстаток	= КоличествоДобавления;
	ФормаВводаКоличества.Количество 		= КоличествоДобавления;
	ФормаВводаКоличества.ДлинаНомера		= ДлинаНомера;
	ФормаВводаКоличества.НомерНачальный		= "";
	ФормаВводаКоличества.НомерКонечный		= "";
	
	ФормаВводаКоличества.Открыть();

КонецПроцедуры // ОткрытьФормуВводаКоличества()

&НаСервере
Процедура ПоместитьСписокПодобранныхВХранилище()
	
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		ПоместитьВоВременноеХранилище(ТаблицаПодобранных.Выгрузить(), АдресВХранилище);		
	КонецЕсли;

КонецПроцедуры // ПоместитьСписокПодобранныхВХранилище()

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеНастройкиОтбора(Форма)

	Результат = НСтр("ru='количество - %1, начальный номер - %2, конечный номер - %3'");
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Результат, 
																	Форма.ЗапрашиватьКоличество,
																	Форма.ЗапрашиватьНачальныйНомер,
																	Форма.ЗапрашиватьКонечныйНомер);

КонецФункции // ПредставлениеНастройкиОтбора()

&НаКлиентеНаСервереБезКонтекста
Процедура ОтформатироватьВведенныйНомерБСО(ТекущиеДанные, ИмяПоля, ЗаполнитьКоличество = Ложь,
	ИмяТабличнойЧасти = "СоставБСО") Экспорт
	
	ПорядковыйНомер = ТекущиеДанные[ИмяПоля];
	Если НЕ ЗначениеЗаполнено(ПорядковыйНомер) Тогда
		Возврат;
	КонецЕсли;
	ДлинаНомера = ТекущиеДанные.ДлинаНомера;
	
	ДлинаНомераФормата = ?(ДлинаНомера=0,ОбщегоНазначенияБГУКлиентСервер.МаксимальнаяДлинаНомераБСО(),ДлинаНомера);
	НомерСтрокой = Формат(Число(ПорядковыйНомер), "ЧГ=0");
	ДлинаЧисла   = СтрДлина(НомерСтрокой);
	
	КоличествоСимволов = ДлинаНомераФормата - ДлинаЧисла;
	Для к = 1 по КоличествоСимволов Цикл 
		НомерСтрокой = "0" + НомерСтрокой;
	КонецЦикла;
	ТекущиеДанные[ИмяПоля] = НомерСтрокой;
	
	#Если Клиент Тогда
	Если ЗаполнитьКоличество Тогда
		УправлениеМатериальнымиЗапасамиКлиент.ЗаполнитьКоличествоВТЧПоНомерамБСО(ТекущиеДанные);
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредставлениеНастроекОтбора() Экспорт

	ТекстНастройка = ПредставлениеНастройкиОтбора(ЭтаФорма);

КонецПроцедуры // УстановитьПредставлениеНастроекОтбора()

&НаСервере
Функция ПеренестиВДокументВсеНаСервере()

	СхемаКомпоновки = ОбщийМодульСКД.СхемаКомпоновкиДанныхИзДинамическогоСписка(Список, Элементы.Список);
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, КомпоновщикНастроек.Настройки,,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаОбъектов = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ТаблицаОбъектовДляПереноса = ТаблицаОбъектов.СкопироватьКолонки();
	ТаблицаОбъектовДляПереноса.Колонки.Добавить("ДлинаНомера", Новый ОписаниеТипов("Число"));
	ТаблицаОбъектовДляПереноса.Колонки.Добавить("НомерНачальный", Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектовДляПереноса.Колонки.Добавить("НомерКонечный", Новый ОписаниеТипов("Строка"));
	Для каждого СтрокаОбъектов Из ТаблицаОбъектов Цикл
	
		ПараметрыОстатков = ПараметрыПолученияОстатковБСО(ЭтаФорма, СтрокаОбъектов.БСО, СтрокаОбъектов.СерияБСО);
		ДипазоныОстатков = ПолучитьДиапазоныОстатковБСО(ПараметрыОстатков);
		
		Для каждого ТекДиапазон Из ДипазоныОстатков Цикл
		
			НовСтрока = ТаблицаОбъектовДляПереноса.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаОбъектов);
			НовСтрока.ДлинаНомера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовСтрока.БСО, "ДлинаНомера");
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекДиапазон);
			ОтформатироватьВведенныйНомерБСО(НовСтрока, "НомерНачальный",, "ТаблицаПодобранных");
			ОтформатироватьВведенныйНомерБСО(НовСтрока, "НомерКонечный",, "ТаблицаПодобранных");
		
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОбъектовДляПереноса, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКонтекстФормы()

	Если ФормаВводаКоличества = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗапрашиватьКоличество",			ЗапрашиватьКоличество);
		ПараметрыФормы.Вставить("ЗапрашиватьНачальныйНомер",		ЗапрашиватьНачальныйНомер);
		ПараметрыФормы.Вставить("ЗапрашиватьКонечныйНомер",			ЗапрашиватьКонечныйНомер);
		ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца",	Истина);
		ФормаВводаКоличества = ПолучитьФорму("Справочник.БСО.Форма.ФормаВводаКоличества", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
	КонтекстФормы = Новый Структура;
	КонтекстФормы.Вставить("ВыделенныеСтроки", 		Элементы.Список.ВыделенныеСтроки);
	КонтекстФормы.Вставить("КоличествоСтрок", 		Элементы.Список.ВыделенныеСтроки.Количество());
	КонтекстФормы.Вставить("ВГраница", 				Элементы.Список.ВыделенныеСтроки.ВГраница());
	КонтекстФормы.Вставить("ТекущийИндекс",			?(КонтекстФормы.КоличествоСтрок = 0, 1, 0));

КонецПроцедуры // ЗаполнитьКонтекстФормы()

&НаКлиенте
Процедура ОбработатьВыборКоличества(ВыбранноеЗначение)
	Перем НомерНачальный;
	Перем НомерКонечный;
	Перем КоличествоДобавления;

	ИндексСтроки = КонтекстФормы.ТекущийИндекс;
	ТекущиеДанные = Элементы.Список.ДанныеСтроки(КонтекстФормы.ВыделенныеСтроки[ИндексСтроки]);
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ВыбранноеЗначение.Свойство("КоличествоДобавления",	КоличествоДобавления);
		ВыбранноеЗначение.Свойство("НомерНачальный",		НомерНачальный);
		ВыбранноеЗначение.Свойство("НомерКонечный",			НомерКонечный);
	КонецЕсли;
		
	ДобавитьПозициюВКорзину(ТекущиеДанные, КоличествоДобавления, НомерНачальный, НомерКонечный);
	КонтекстФормы.ТекущийИндекс = ИндексСтроки + 1;
	ПродолжитьДобавлениеОтобранных();

КонецПроцедуры // ОбработатьВыборКоличества()

&НаКлиенте
Процедура ДобавитьПозициюВКорзину(ТекущиеДанные, КоличествоДобавления, НомерНачальный = Неопределено,
	НомерКонечный = Неопределено, ФорматироватьНомер = Ложь)
	
	Перем НомерНачальныйСравнения;
	
	БСО = ТекущиеДанные.БСО;
	СерияБСО = ТекущиеДанные.СерияБСО;
	
	Если ЗначениеЗаполнено(НомерНачальный) Тогда
		НомерНачальныйСравнения = Число(НомерНачальный);
	КонецЕсли;
	
	КоличествоПодобранных = ТаблицаПодобранных.Количество();
	Для Индекс = 0 По КоличествоПодобранных - 1 Цикл
		ТекущаяСтрока = ТаблицаПодобранных[Индекс];
		
		Если ТекущаяСтрока.БСО = БСО И ТекущаяСтрока.СерияБСО = СерияБСО Тогда
			Если ЗначениеЗаполнено(НомерНачальныйСравнения) И ЗначениеЗаполнено(ТекущаяСтрока.НомерКонечный) Тогда
				Если Число(ТекущаяСтрока.НомерКонечный) + 1 = НомерНачальныйСравнения Тогда
					
					ТекКонечныйНомер = Число(ТекущаяСтрока.НомерКонечный);
					ТекущаяСтрока.Количество = ТекущаяСтрока.Количество + КоличествоДобавления;
					УправлениеМатериальнымиЗапасамиКлиент.ЗаполнитьНомерКонечныйПоНомеруНачальномуИКоличеству(
						ТекущаяСтрока);
					ОбъединитьДиапазоныНомеров(ТекущаяСтрока);
					Возврат;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

	НовСтрока = ТаблицаПодобранных.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтрока, ТекущиеДанные);
	НовСтрока.Количество = КоличествоДобавления;
	Если НомерНачальный <> Неопределено Тогда
		НовСтрока.НомерНачальный = Формат(НомерНачальный, "ЧГ=0");
		Если ФорматироватьНомер Тогда
			ОтформатироватьВведенныйНомерБСО(НовСтрока, "НомерНачальный",, "ТаблицаПодобранных");
		КонецЕсли;
	КонецЕсли;
	Если НомерКонечный <> Неопределено Тогда
		НовСтрока.НомерКонечный = Формат(НомерКонечный, "ЧГ=0");
		Если ФорматироватьНомер Тогда
			ОтформатироватьВведенныйНомерБСО(НовСтрока, "НомерКонечный",, "ТаблицаПодобранных");
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(НовСтрока.Количество)
		И ЗначениеЗаполнено(НовСтрока.НомерНачальный) 
		И НЕ ЗначениеЗаполнено(НовСтрока.НомерКонечный) Тогда
		
		УправлениеМатериальнымиЗапасамиКлиент.ЗаполнитьНомерКонечныйПоНомеруНачальномуИКоличеству(НовСтрока);
		
	КонецЕсли;
	
	ОбъединитьДиапазоныНомеров(НовСтрока);
	
КонецПроцедуры // ДобавитьПозициюВКорзину()

&НаКлиенте
Процедура ОбъединитьДиапазоныНомеров(ТекущиеДанные)

	БСО = ТекущиеДанные.БСО;
	СерияБСО = ТекущиеДанные.СерияБСО;
	Если ЗначениеЗаполнено(ТекущиеДанные.НомерНачальный) Тогда
		НомерНачальный = Число(ТекущиеДанные.НомерНачальный);
	Иначе
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.НомерКонечный) Тогда
		НомерКонечный = Число(ТекущиеДанные.НомерКонечный);
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущиеДанные.НомерКонечный) И ТекущиеДанные.Количество = 1 И ЗначениеЗаполнено(ТекущиеДанные.НомерНачальный) Тогда
		НомерКонечный = Число(ТекущиеДанные.НомерНачальный);
	Иначе
		Возврат;
	КонецЕсли;
	
	ИндексВперед	= -1;
	ИндексНазад		= -1;
	
	Для каждого ТекСтрока Из ТаблицаПодобранных Цикл
	
		Если ТекСтрока.БСО = БСО И ТекСтрока.СерияБСО = СерияБСО Тогда
			
			Если ЗначениеЗаполнено(ТекСтрока.НомерНачальный) И Число(ТекСтрока.НомерНачальный) - 1 = НомерКонечный Тогда
				ИндексНазад = ТаблицаПодобранных.Индекс(ТекСтрока);
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.НомерКонечный) И Число(ТекСтрока.НомерКонечный) + 1 = НомерНачальный Тогда
				ИндексВперед = ТаблицаПодобранных.Индекс(ТекСтрока);
			ИначеЕсли Не ЗначениеЗаполнено(ТекСтрока.НомерКонечный) И ТекСтрока.Количество = 1 И Число(ТекСтрока.НомерНачальный) + 1 = НомерНачальный Тогда
				ИндексВперед = ТаблицаПодобранных.Индекс(ТекСтрока);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если ИндексВперед < 0 И ИндексНазад < 0 Тогда
		Возврат;	
	КонецЕсли;
	
	СтрокиКУдалению = Новый Массив;
	
	Если ИндексВперед >= 0 Тогда
		
		Строка = ТаблицаПодобранных[ИндексВперед];
		ТекущиеДанные.НомерНачальный = Число(ТекущиеДанные.НомерНачальный) + Число(Строка.НомерНачальный);
		ТекущиеДанные.Количество = ТекущиеДанные.Количество + Строка.Количество;
		СтрокиКУдалению.Добавить(Строка);
		
	КонецЕсли;
	
	Если ИндексНазад >= 0 Тогда
		Строка = ТаблицаПодобранных[ИндексНазад];
		ТекущиеДанные.Количество = ТекущиеДанные.Количество + Строка.Количество;
		СтрокиКУдалению.Добавить(Строка);
	КонецЕсли;
	
	УправлениеМатериальнымиЗапасамиКлиент.ЗаполнитьНомерКонечныйПоНомеруНачальномуИКоличеству(ТекущиеДанные);
	
	Для каждого ТекСтрока Из СтрокиКУдалению Цикл
	
		ТаблицаПодобранных.Удалить(ТекСтрока);
	
	КонецЦикла; 

КонецПроцедуры // ОбъединитьДиапазоныНомеров()

#КонецОбласти
